app/views/sessions/login.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
<% if session[:id] %>
  <p><%= User.find(session[:id]).name %></p>