app/views/recipes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  	<p class="text-center"><%= Love.where(recipe_id: @recipe.id ).length %> people have loved this recipe</p>
  	<p class="text-center">Recipe by: <a href="/users/<%= @recipe.user_id %>"><%= User.find_by(id: @recipe.user_id).name %></a> </p>