app/controllers/sessions_controller.rb

INSERT INTO "users" ("token", "name", "pic", "uid", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    token = auth_hash.credentials.token
    name = auth_hash.info.name
    pic = auth_hash.info.image
    uid = auth_hash.uid
    email = auth_hash.info.email

    user = User.create!(token: token, name: name, pic: pic, uid: uid, email: email)